---
title: HVACLoadType
classe: Autodesk.Revit.DB.Analysis.HVACLoadType
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# HVACLoadType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double AirChangesPerHour { get; set; }` | `hVACLoadType.AirChangesPerHour` | Double |
| `Double AreaPerPerson { get; set; }` | `hVACLoadType.AreaPerPerson` | Double |
| `Double CoolingSetPoint { get; set; }` | `hVACLoadType.CoolingSetPoint` | Double |
| `Double DehumidificationSetPoint { get; set; }` | `hVACLoadType.DehumidificationSetPoint` | Double |
| `Double HeatingSetPoint { get; set; }` | `hVACLoadType.HeatingSetPoint` | Double |
| `Double HumidificationSetPoint { get; set; }` | `hVACLoadType.HumidificationSetPoint` | Double |
| `Double LatentHeatGainPerPerson { get; set; }` | `hVACLoadType.LatentHeatGainPerPerson` | Double |
| `Double LightingLoadDensity { get; set; }` | `hVACLoadType.LightingLoadDensity` | Double |
| `OutdoorAirFlowStandard OutdoorAirFlowStandard { get; set; }` | `hVACLoadType.OutdoorAirFlowStandard` | OutdoorAirFlowStandard |
| `Double OutdoorAirPerArea { get; set; }` | `hVACLoadType.OutdoorAirPerArea` | Double |
| `Double OutdoorAirPerPerson { get; set; }` | `hVACLoadType.OutdoorAirPerPerson` | Double |
| `Double PlenumLighting { get; set; }` | `hVACLoadType.PlenumLighting` | Double |
| `Double PowerLoadDensity { get; set; }` | `hVACLoadType.PowerLoadDensity` | Double |
| `Double SensibleHeatGainPerPerson { get; set; }` | `hVACLoadType.SensibleHeatGainPerPerson` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```